
#Область ОбработчикиКоманд


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УстановитьВебхукНаСервере(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура УстановитьВебхукНаСервере(ПараметрКоманды)
	
	Токен 					 = ПараметрКоманды.Токен;
	url = "";
	АдресЗапроса = СтрШаблон("/bot%1/setwebhook?url=%2",Токен, ПараметрКоманды.АдресWebhook);
	Ответ = КоннекторHTTP.GetJson("api.telegram.org"+АдресЗапроса);

КонецПроцедуры

#КонецОбласти