
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьWebhook(Команда)
	УстановитьWebhookНаСервере(Объект.Токен, Объект.АдресWebhook);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполнение метода setWebhook
// см. https://core.telegram.org/bots/api#setwebhook
// 
// Параметры:
//  Токен - Строка - Токен
//  АдресWebhook - Строка - Адрес webhook
&НаСервереБезКонтекста
Процедура УстановитьWebhookНаСервере(Токен, АдресWebhook)
	
	АдресЗапроса = СтрШаблон("/bot%1/setwebhook?url=%2",Токен, АдресWebhook);
	Ответ = КоннекторHTTP.GetJson("api.telegram.org"+АдресЗапроса);
	Сообщение = новый СообщениеПользователю();
	Сообщение.Текст = Ответ.description;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти