
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураНастроекИнтеграции = СтруктураНастроекИнтеграции();
	
	Токен 					 = СтруктураНастроекИнтеграции.Токен;
	АдресЗапроса = СтрШаблон("/bot%1/webhookinfo",Токен);
	
	Ответ = КоннекторHTTP.GetJson("api.telegram.org"+АдресЗапроса);
	
	СообщениеПользователю("Результат проверки webhookinfo " + Ответ);
	

	
КонецПроцедуры

Функция СтруктураНастроекИнтеграции(ИмяБота = Неопределено) Экспорт
	
	Если ИмяБота = Неопределено Тогда
		ИмяБота = ИмяБотаПоУмолчанию();
	КонецЕсли;	
	
	СтруктураНастроекИнтеграции = Новый Структура;
	СтруктураНастроекИнтеграции.Вставить("Токен", "");
	СтруктураНастроекИнтеграции.Вставить("update_id", 0);
	СтруктураНастроекИнтеграции.Вставить("ИмяБота", ИмяБота);
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииTelegram.Настройка,
	|	НастройкиИнтеграцииTelegram.Значение
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииTelegram КАК НастройкиИнтеграцииTelegram
	|ГДЕ
	|	НастройкиИнтеграцииTelegram.Бот = &Бот");
	
	Запрос.УстановитьПараметр("Бот", ИмяБота);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураНастроекИнтеграции.Вставить(Выборка.Настройка, Выборка.Значение);
	КонецЦикла;
	

	Возврат СтруктураНастроекИнтеграции;
	
КонецФункции
