

#Область ОбработчикиСобытий



Процедура ДействиеЧтоДелалВчераПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ИнтеграцияСМессенджерами.TelegramSendMessage(, "Что делали вчера?", Пользователь.chat_id);
	
	
КонецПроцедуры

Процедура ДействиеЧтоБудешьДелатьСегодняПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ИнтеграцияСМессенджерами.TelegramSendMessage(, "Что будете делать сегодня?", Пользователь.chat_id);
	
	
КонецПроцедуры

Процедура ДействиеКакиеПроблемыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ИнтеграцияСМессенджерами.TelegramSendMessage(, "Какие были проблемы?", Пользователь.chat_id);
	
КонецПроцедуры


Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ИнтеграцияСМессенджерами.TelegramSendMessage(, "Спасибо, так и запишем.", Пользователь.chat_id);
	
	ОтправитьРезультатРуководителю();
	
КонецПроцедуры

Процедура ОтправитьРезультатРуководителю()

    //надо где-то хранить руководителя
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.chat_id КАК chat_id,
		|	СтатусМитинг.Пользователь КАК Пользователь,
		|	ЗадачиПользователей.Наименование КАК Вопрос,
		|	ЗадачиПользователей.Ответ КАК Ответ,
		|	ЗадачиПользователей.Дата КАК Дата
		|ИЗ
		|	БизнесПроцесс.СтатусМитинг КАК СтатусМитинг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗадачиПользователей КАК ЗадачиПользователей
		|		ПО СтатусМитинг.Ссылка = ЗадачиПользователей.БизнесПроцесс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО (Пользователи.Роль = ЗНАЧЕНИЕ(Перечисление.РолиПользователей.Руководитель))
		|			И (Пользователи.Активен)
		|			И (НЕ Пользователи.Ссылка = СтатусМитинг.Пользователь)
		|ГДЕ
		|	Пользователи.Роль = ЗНАЧЕНИЕ(Перечисление.РолиПользователей.Руководитель)
		|	И Пользователи.Активен
		|	И СтатусМитинг.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	МАКСИМУМ(Пользователь)
		|ПО
		|	chat_id";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборкаchat_id = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборкаchat_id.Следующий() Цикл
		
		СтрокаСообщения = СтрШаблон("Отчет для Стендап митинга по %1", Выборкаchat_id.Пользователь);
		ИнтеграцияСМессенджерами.TelegramSendMessage(, СтрокаСообщения, Выборкаchat_id.chat_id);
	
		ВыборкаДетальныеЗаписи = Выборкаchat_id.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаСообщения = СтрШаблон("%1 %2", ВыборкаДетальныеЗаписи.Вопрос, ВыборкаДетальныеЗаписи.Ответ);
			ИнтеграцияСМессенджерами.TelegramSendMessage(, СтрокаСообщения, Выборкаchat_id.chat_id);
			
		КонецЦикла;
	КонецЦикла;
	

КонецПроцедуры

#КонецОбласти