
&НаКлиенте
Асинх  Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	Результат = Ждать ВвестиСтрокуАсинх("", "Введите username Telegram");
	
	Если Результат <> Неопределено Тогда
	
		   //1. Запишем user в списки на приглашения
		   
		   ДобавитьЗаписьПриглашенияНаСервере(Результат, ПараметрКоманды);
		   
		   //2. Отправить ссылку на чат пользователю 
		   
		   //Нужен метод получения сведения пользователя (chat_id) по никнейму
		   // Здесь пишут что такого нет https://github.com/yagop/node-telegram-bot-api/issues/383
		   //https://qna.habr.com/q/925089
		   
	КонецЕсли; 
	
КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Username>  - <Тип.Строка> - <Значение username пользователя Telegram>
//  <Команда>  - <Тип.СправочникСсылка.Команды> - <Каманда в которую добавляется пользователь>
&НаСервере
Процедура ДобавитьЗаписьПриглашенияНаСервере(Username, Команда)
	
		Запись = РегистрыСведений.ПриглашенияВКоманду.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.Команда = Команда;
		Запись.username = Username;
		
		Запись.ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		Запись.Записать(Истина);	
		
КонецПроцедуры // ()
